package com.leetcode.plan.number;

/**
 * @author jxm
 * @version 1.0
 * @date 2021/8/17 11:14
 */
public class NineSevenSeven {

    /**
     * @题号：977
     *
     *
     * @描述：
     *      给你一个按 非递减顺序 排序的整数数组 nums，返回 每个数字的平方 组成的新数组，要求也按 非递减顺序 排序。
     *
     * @特别注意：
     *      时间复杂度为 O(n)
     *
     *      输入：nums = [-4,-1,0,3,10]
     *      输出：[0,1,9,16,100]
     *      解释：平方后，数组变为 [16,1,0,9,100]
     *      排序后，数组变为 [0,1,9,16,100]
     *
     *
     * @思路：
     *
     * @考察:
     *
     * @拓展：
     *
     */
}
